[
    {
        "version": "1.6",
        "date": "2021-10-03",

        "changes": [
            "Removed IR Light Sensor. You didn't notice it was gone, did you?",
            "Added D.O.T.S. Projector to primary items.",
            "Disabled Ghost Evidence randomizer feature until ghost evidence and new types are updated.",
            "Fixed a bug with two tooltips showing on hover.",
            "Updated changelog modal to hide older changes so that modal height is not excessive."
        ]
    },

    {
        "version": "1.5",
        "date": "2021-06-15",

        "changes": [
            "Added new ghosts Hantu and Yokai to the Ghost Evidence Randomizer options.",
            "Added new map Willow Street House to the Maps randomizer choices.",
            "Reduced clutter with the display of tips. Now only showing a couple tips at a time.",
            "Added information about implicit licensing of the tool to README page.",
            "Adjustments to presentation to ensure that the randomizer is in compliance with content guidelines."
        ]
    },

    {
        "version": "1.4",
        "date": "2021-06-02",
        
        "changes": [
            "Added a tip about chroma / color key functionality for content creators.",
            "Added a setting to always include lighter in the randomized secondary items.",
            "More adjustments to map randomization to force variety between map sizes.",
            "Added tooltips to action icons in each heading for readability."
        ]
    },

    {
        "version": "1.3",
        "date": "2021-05-25",

        "changes": [
            "Fixed a bug where optional items would not show in the Use / Don't Use filtered lists.",
            "Removed maps from the Use / Don't Use filtered lists, so that only items are shown.",
            "Adjusted map randomization to make it force variety between map sizes more."
        ]
    },

    {
        "version": "1.2",
        "date": "2021-05-20",

        "changes": [
            "Added image overlay functionality to settings for concise on-stream overlay.",
            "Updated recent changes list to show multiple dates of changes.",
            "Moved and re-styled ghost evidence randomizer option to be consistent."
        ]
    },

    {
        "version": "1.1",
        "date": "2021-05-11",

        "changes": [
            "Added a changelog and notification about active development.",
            "Removed Grafton from difficult map list because it is no longer a death trap.",
            "Remove automatic enabling of candle and glowstick, as the QoL change caused some confusion.",
            "Lighter and head camera are a different color when required by other items to indicate that they're optional or not included in settings.",
            "Fixed bug where IR Light Sensor lacked sufficient enthusiasm (exclamation points).",
            "Adjusted Insane difficulty to be more difficult by excluding hunt prevention items, excluding alternative evidence items, and reducing secondary item quantities.",
            "Added a tip about evidence elimination features available in the randomizer.",
            "Added click functionality for toggling individual randomizer selections on or off.",
            "Added a tip about optional or included items like the lighter and head camera."
        ]
    }
]